Grid_Independence/straightDiamond_33313/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontandback
    {
        type            empty;
        inGroups        List<word> 1(wall);
        nFaces          66626;
        startFace       66213;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          428;
        startFace       132839;
    }
    diamond
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       133267;
    }
    inlet
    {
        type            patch;
        nFaces          139;
        startFace       133367;
    }
    outlet
    {
        type            patch;
        nFaces          139;
        startFace       133506;
    }
)

// ************************************************************************* //
